{
  "backend/main.mo": "Minimal Motoko actor with no functionality.",
  "feature_evidence.json": "JSON report describing implemented features, related files, components, and test IDs for the Valentine SPA project.",
  "frontend-file-summaries.txt": "Prewritten summaries for all frontend components, hooks, styling files, and config files.",
  "frontend/index.css": "Global Tailwind CSS setup defining theme variables, dark mode, base styles, and utility applications.",
  "frontend/index.html": "Base HTML document that mounts the React app and loads main.tsx.",
  "frontend/src/App.tsx": "Root React component rendering the ValentinePage.",
  "frontend/src/components/valentine/FloatingHeartsBackground.tsx": "Renders animated floating heart emojis positioned across the screen.",
  "frontend/src/components/valentine/HeartBurstLayer.tsx": "Displays animated burst hearts at specified screen coordinates.",
  "frontend/src/components/valentine/LoveLetterDialog.tsx": "Popup dialog showing a love letter with close controls.",
  "frontend/src/components/valentine/ProposalCard.tsx": "Interactive proposal card with YES/NO buttons and moving NO behavior.",
  "frontend/src/components/valentine/QuoteBlock.tsx": "Simple styled block containing a romantic quote.",
  "frontend/src/components/valentine/ReasonsCard.tsx": "Card that shows a random reason for love when the button is clicked.",
  "frontend/src/components/valentine/RelationshipTimerCard.tsx": "Displays a live-updating timer showing relationship duration.",
  "frontend/src/components/valentine/SecretMessageDialog.tsx": "Dialog revealing a secret message once unlocked.",
  "frontend/src/components/valentine/SecretUnlockCard.tsx": "Card with password input that unlocks the secret message dialog.",
  "frontend/src/components/valentine/ValentineCard.tsx": "Reusable card wrapper applying shared Valentine-themed styling.",
  "frontend/src/components/valentine/ValentineFooter.tsx": "Footer with Valentine messages and a caffeine.ai attribution link.",
  "frontend/src/components/valentine/ValentineHeader.tsx": "Header with title, subtitle, and clickable heart triggering animations.",
  "frontend/src/hooks/useActor.ts": "Creates and caches a backend actor based on Internet Identity, refetching dependent queries when identity changes.",
  "frontend/src/hooks/useHeartBurst.ts": "Manages heart burst animations by generating timed floating heart items.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity auth context with login, logout, and stored identity loading using Dfinity AuthClient.",
  "frontend/src/hooks/useRelationshipTimer.ts": "Computes and updates a live timer since a fixed 2022-08-01 start date.",
  "frontend/src/index.css": "Defines Tailwind base plus custom Valentine-themed styles, colors, animations, and UI components.",
  "frontend/src/main.tsx": "Initializes React app with QueryClient and InternetIdentityProvider wrappers.",
  "frontend/src/pages/ValentinePage.tsx": "Assembles the full Valentine-themed page with cards, dialogs, timers, and heart burst interactions.",
  "frontend/tailwind.config.js": "Tailwind configuration extending theme colors, fonts, animations, and enabling plugins.",
  "project_state.json": "Metadata describing project state, features, and requirements for the Valentine SPA."
}